[{"regex":"/(^| )(girl|female|woman|lady)($| )/","copypasta":"\nExcuse me sir or ma'am\n\nbut I couldn't help but notice.... are you a \"girl\"?? A \"female?\" A \"member of the finer sex?\"\n\nNot that it matters too much, but it's just so rare to see a girl around here! I don't mind, no--quite to the contrary! It's so refreshing to see a girl online, to the point where I'm always telling all my friends \"I really wish girls were better represented on the internet.\"\n\nAnd here you are!\n\nI don't mean to push or anything, but if you wanted to DM me about anything at all, I'd love to pick your brain and learn all there is to know about you. I'm sure you're an incredibly interesting girl--though I see you as just a person, really--and I think we could have lots to teach each other.\n\nI've always wanted the chance to talk to a gorgeous lady--and I'm pretty sure you've got to be gorgeous based on the position of your text in the picture--so feel free to shoot me a message, any time at all! You don't have to be shy about it, because you're beautiful anyways (that's juyst a preview of all the compliments I have in store for our chat).\n\nLooking forwards to speaking with you soon, princess!\n\nEDIT: I couldn't help but notice you haven't sent your message yet. There's no need to be nervous! I promise I don't bite, haha\n\nEDIT 2: In case you couldn't find it, you can click the little chat button from my profile and we can get talking ASAP. Not that I don't think you could find it, but just in case hahah\n\nEDIT 3: look I don't understand why you're not even talking to me, is it something I said?\n","enabled":true},{"regex":"/(^| )(anthem)($| )/","copypasta":"\nСоюз нерушимый республик свободных\nСплотила навеки Великая Русь\nДа здравствует созданный волей народов\nЕдиный, могучий Советский Союз\nСлавься, Отечество наше свободное\nДружбы народов надёжный оплот!\nПартия Ленина - сила народная\nНас к торжеству коммунизма ведёт\nСквозь грозы сияло нам солнце свободы\nИ Ленин великий нам путь озарил\nНа правое дело он поднял народы\nНа труд и на подвиги нас вдохновил\nСлавься, Отечество наше свободное\nДружбы народов надёжный оплот\nПартия Ленина - сила народная\nНас к торжеству коммунизма ведёт\nВ победе бессмертных идей коммунизма\nМы видим грядущее нашей страны\nИ Красному знамени славной Отчизны\nМы будем всегда беззаветно верны\nСлавься, Отечество наше свободное\nДружбы народов надёжный оплот\nПартия Ленина - сила народная\nНас к торжеству коммунизма ведёт\n","enabled":true},{"regex":"/(^| )(linux)($| )/","copypasta":"\nI'd just like to interject for a moment.  What you're referring to as Linux,\nis in fact, GNU/Linux, or as I've recently taken to calling it, GNU plus Linux.\nLinux is not an operating system unto itself, but rather another free component\nof a fully functioning GNU system made useful by the GNU corelibs, shell\nutilities and vital system components comprising a full OS as defined by POSIX.\n\nMany computer users run a modified version of the GNU system every day,\nwithout realizing it.  Through a peculiar turn of events, the version of GNU\nwhich is widely used today is often called \"Linux\", and many of its users are\nnot aware that it is basically the GNU system, developed by the GNU Project.\n\nThere really is a Linux, and these people are using it, but it is just a\npart of the system they use.  Linux is the kernel: the program in the system\nthat allocates the machine's resources to the other programs that you run.\nThe kernel is an essential part of an operating system, but useless by itself;\nit can only function in the context of a complete operating system.  Linux is\nnormally used in combination with the GNU operating system: the whole system\nis basically GNU with Linux added, or GNU/Linux.  All the so-called \"Linux\"\ndistributions are really distributions of GNU/Linux.\n","enabled":true}]