{"ban":"\nUsage: `ban [mention of user to ban]`.\n\nRequires banning privilege for both the bot and whoever issues the command.\n","cat":"\nThis command will return a random cat image.\n","curse":"\nUsage: `curse [text to curse]`.\n\nThis command will return all text behind the command, but stylized Ì·Í—Í˜LÌ·Ì“ÍIÌ¸ÍÍ—KÌµÌ“Ì“EÌ´Ì¾Ì” Ì´Ì†Í TÌ¶Ì›Ì¾HÌ·Ì‹Í„IÌ¸ÍÍ—SÌ·ÌÍ.\n","dmme":"\nUsage: `dmme (text to send`)\n\nWill send a dm (private message) to the user who issued the command.\nThe message will contain the given text, or alternatively a placeholder text.\n","doom":"\nThis command is experimental. It will return an animation of 2 spheres using a custom ray marcher.\n","emoji":"\nUsage: `emoji [maximum amount of emoji per word] [text to put emojis in]`.\n\nNote that too long messages with too much emojis will not be returned, as per discord character limit.\n","emote":"\nUsage: `emote [discord server custom emote]`.\n\nThis will not work with unicode or default discord emotes.\n","fancy":"\nUsage: `fancy [text to stylize]`.\n\nReturns the text but stylized ğ•ƒğ•€ğ•‚ğ”¼ ğ•‹â„ğ•€ğ•Š.\n","flip":"\n\"Flips a coin\".\n\nHas a 50% chance of returning `true`, returns `false` otherwise.\n","help":"\nUsage: `help (command)`.\n\nWill return a list of available command if no arguments given, will return the help page of a specific command if an argument is given, for an existing command which is enabled in the server it's requested from.\n","kick":"\nUsage: `kick [metion of user to kick]`.\n\nRequires kicking privilege for both the bot and whoever issues the command.\n","mock":"\nUsage: `mock [text to mock]`.\n\nWill return the given text stylized lIkE ThIs\n","music":"\nUsage: `music [command]`.\n\nAvailable music commands:\n    play [youtube url or video id]\n        Plays the track from youtube to the voice channel the user is in.\n    \n    pause\n        Pauses the track playing in the voice channel the user is in.\n    \n    resume\n        Resumes the track paused in the voice channel the user is in.\n    \n    volume [percentage]\n        Sets the volume from a percentage. Raising the percentage above 100 is possible, but will decrease sound quality.\n    \n    stop\n        Stops playback and lets the bot leave the channel it's currently in\n    \nRequires command caching to be enabled by the bot sysadmin due to technical reasons.\n","pfp":"\nUsage: `pfp (mention)`\n\nWill return a full res version of the mentioned user's profile picture, or the message author if none is given.\n","ping":"\nWill return a text plus the name of who sent the text.\n","quantumflip":"\n\"Flips a coin\", but does it using the ANU Quantum Random Numbers Server api.\n\nThis guarantees a fully random result, as per laws of physics. Result might be a bit slower than the normal flip command, but is more ~~overkill~~ random. \n","remindme":"\nUsage: `remindme [time] (note)`.\n\nWill ping you with an optional note you give after the specified amount of *minutes*.\n","say":"\nUsage: `say [text]`.\n\nWill simply repeat you by sending the given text.\n","scream":"\nUsage: `scream [text]`.\n\nWill return the given text but stylized ***L I K E   T H I S***.\n","search":"\nUsage: `search [search query]`.\n\nWill help you search for the query.\n","update":"\nSysadmin only.\n\nWill update the bot from github to the latest version. Clearing the command cache using the clearcache command might be neccesary.\n","uptime":"\nReturns the uptime of the bot.\n","uwu":"\nUsage: `uwu [text]`.\n\nWill return the given text but stylized wike this.\n","whisper":"\nUsage: `whisper [text]`.\n\nWill return the given text but stylized Ë¡â±áµáµ‰ áµ—Ê°â±Ë¢.\n","ytdl":"\nUsage: `ytdl [youtube url/video id]`.\n\nWill return an mp3 file with the audio of the given youtube video. Will not work on longer tracks thanks do the discord 8mb file size limit.\n"}